load-tests/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase: gradually increase load
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase: simulate increasing traffic
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up to peak load"
    
    # Peak load phase: sustained high traffic
    - duration: 180
      arrivalRate: 50
      name: "Peak load"
    
    # Cool-down phase: gradual decrease
    - duration: 60
      arrivalRate: 50
      rampTo: 10
      name: "Cool-down"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 2000        # 95th percentile response time < 2000ms
    p99: 5000        # 99th percentile response time < 5000ms
  
  # HTTP settings
  http:
    timeout: 30
    
  # Plugins for enhanced reporting
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  # Scenario 1: Browse and search offices
  - name: "Browse Sanad Offices"
    weight: 30
    flow:
      - get:
          url: "/api/trpc/sanad.listOffices?input={}"
          expect:
            - statusCode: 200
            - contentType: json
      
      - think: 2
      
      - get:
          url: "/api/trpc/sanad.searchOffices?input=%7B%22query%22%3A%22business%22%7D"
          expect:
            - statusCode: 200
  
  # Scenario 2: View office details and services
  - name: "View Office Details"
    weight: 25
    flow:
      - get:
          url: "/api/trpc/sanad.getOfficeById?input=%7B%22id%22%3A1%7D"
          expect:
            - statusCode: 200
      
      - think: 3
      
      - get:
          url: "/api/trpc/sanad.getOfficeServices?input=%7B%22officeId%22%3A1%7D"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: "/api/trpc/sanad.getOfficeReviews?input=%7B%22officeId%22%3A1%7D"
          expect:
            - statusCode: 200
  
  # Scenario 3: Browse service requests
  - name: "Browse Service Requests"
    weight: 20
    flow:
      - get:
          url: "/api/trpc/serviceRequests.list?input={}"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: "/api/trpc/serviceRequests.getById?input=%7B%22id%22%3A1%7D"
          expect:
            - statusCode: 200
  
  # Scenario 4: View dashboard (authenticated scenario simulation)
  - name: "Dashboard Access"
    weight: 15
    flow:
      - get:
          url: "/api/trpc/auth.me"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/api/trpc/bookings.list?input={}"
          expect:
            - statusCode: 200
  
  # Scenario 5: Static assets and homepage
  - name: "Homepage and Static Assets"
    weight: 10
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/assets/index.css"