load-tests/smoke-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Quick smoke test: 30 seconds with moderate load
    - duration: 30
      arrivalRate: 10
      name: "Smoke test"
  
  ensure:
    maxErrorRate: 1
    p95: 2000
  
  http:
    timeout: 30

scenarios:
  - name: "Quick Health Check"
    weight: 40
    flow:
      - get:
          url: "/api/trpc/sanad.listOffices?input={}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/trpc/auth.me"
          expect:
            - statusCode: 200
  
  - name: "Office Details Check"
    weight: 30
    flow:
      - get:
          url: "/api/trpc/sanad.getOfficeById?input=%7B%22id%22%3A1%7D"
          expect:
            - statusCode: 200
  
  - name: "Homepage Check"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200